aadvantage
ability
able
absolute
absurd
abysmal
accept
acceptable
access
accident
accommodate
accommodation
accord
account
acct
accurate
action
actual
additional
address
admiral
adopt
advance
advantage
advertise
advice
advise
advisory
affect
afford
afternoon
agency
agent
agree
airbus
aircraft
airfare
airline
airplane
airport
airway
albany
alert
alliance
allow
alot
alternate
alternative
amaze
america
american
americanair
americanairlines
angry
anniversary
announce
announcement
annoy
answer
apologize
apology
appease
apple
apply
appreciate
approach
appropriate
april
area
argue
arrange
arrival
arrive
article
asap
aspen
assign
assignment
assist
assistance
assult
assume
assure
atlanta
atlantic
attempt
attend
attendant
attention
attitude
august
austin
auto
automate
avail
availability
available
avgeek
aviation
avoid
award
aware
awesome
awful
baby
backup
badcustomerservice
badservice
baggage
balance
ball
band
bank
base
basic
bathroom
battery
battle
bday
beach
beat
beautiful
beer
begin
belong
benefit
bereavement
best
better
biggest
bird
birthday
bite
black
blame
blast
block
blog
blow
blue
bluemanity
board
bonus
book
boot
boston
bostonlogan
bother
bottle
bounce
boyfriend
brand
brandmance
break
breakfast
brilliant
bring
brother
browser
brutal
buffalo
bullshit
bummer
bump
bunch
bush
business
busy
button
cabin
cali
california
callback
camera
canada
canadian
cancel
cancun
capt
captain
card
care
carousel
carrier
carrieunderwood
carry
carryon
cart
case
cash
catch
cater
cause
celebrate
cell
center
central
century
certain
certificate
chair
chairman
challenge
chance
change
chaos
character
charge
charleston
charlotte
cheap
cheaper
check
checkin
checkout
cheer
chicago
child
china
choice
choose
circumstance
city
claim
class
clean
clear
cleveland
click
client
close
clothe
club
clue
cluster
coach
coast
coat
code
coffee
cold
colleague
college
color
columbus
come
comfort
comfortable
comment
commercial
commitment
common
communicate
communication
comp
companion
company
compare
compassion
compensate
compensation
competition
complain
complaint
complete
complimentary
computer
concern
condition
conf
conference
confirm
confirmation
conflict
confuse
confusion
congrats
connect
connection
consider
consistent
constant
cont
contact
content
contest
continue
contract
control
conversation
cool
copy
corp
corporate
corporation
correct
cost
costumer
count
counter
country
couple
coupon
course
courteous
courtesy
cover
cracker
cranky
crap
crappy
crash
crazy
create
credit
crew
cross
crowd
curious
current
cust
customer
customerservice
daily
dallas
damage
damn
dance
data
date
daughter
david
dead
deal
dear
death
decent
decide
decision
define
degree
delay
deliver
delivery
delta
denver
deny
depart
department
departure
deplane
deserve
design
desk
dest
destination
destinationdragons
destroy
device
dfwairport
didnt
diego
diff
difference
different
difficult
difficulty
digital
dinner
direct
dirty
disappear
disappoint
disappointment
disaster
disconnect
discount
discus
disgrace
disgraceful
disgust
disney
display
disregard
dissatisfy
diversion
divert
dividend
dobetter
document
doesnt
dollar
domestic
dont
door
double
doubt
downgrade
dozen
dragon
dream
drink
drive
driver
drop
dull
dumb
dump
earlier
early
earn
earth
easier
east
eastern
easy
economy
efficiency
effort
elevate
elite
ella
email
embarrass
emergency
employee
engine
english
enjoy
enroute
enter
entertainment
entire
epic
epicfail
equipment
error
estimate
europe
event
exact
example
excellent
exception
exceptional
exchange
excite
excuse
exec
executive
exist
existent
exit
expense
expensive
experience
expire
explain
explanation
express
extra
extreme
fabulous
face
facebook
fact
fail
failure
fair
fall
false
family
fantastic
fare
fast
fault
favorite
feature
february
feedback
feel
fiasco
field
fight
figure
file
film
final
fine
finger
finish
firstclass
flat
fleek
fleet
flier
flight
flightation
flightations
flightd
flightlation
flightlations
flightled
flightr
flightst
floor
florida
flts
flyer
flyfi
flyingitforward
flytpa
folk
follow
food
foot
force
forever
forget
form
fort
forth
francisco
fraud
freak
free
freeze
freq
frequent
fresh
friday
friend
friendly
frustrate
frustration
fuck
fuel
fund
funeral
funny
furious
future
gain
game
garbage
gate
general
generic
getaway
gift
girl
glad
glass
glitch
global
gogo
gold
golf
gonna
good
goodwill
gotta
grandma
great
greatservice
green
greet
grind
gross
ground
group
guarantee
guess
guest
guide
guitar
haha
haiti
half
hand
handle
handler
hang
happen
happy
hard
hare
hartford
hassle
hate
haul
hawaii
head
headache
hear
heart
heat
heathrow
hell
hello
help
helpful
hide
high
higher
hire
history
hold
holder
home
honest
honeymoon
honor
hook
hope
horrendous
horrible
horrid
hostage
hotel
hour
house
houston
http
hubby
huge
human
hungry
hunt
husband
idea
idiot
ignore
imagine
imaginedragons
impact
important
impossible
impress
inbound
incentive
incident
inclement
incompetence
incompetent
inconvenience
inconvenient
increase
incredible
indicate
industry
inexcusable
infant
inflight
info
inform
information
initial
injury
inquire
insane
inspire
insult
international
internet
interview
intl
invalid
ipad
iphone
irritate
isnt
issue
item
itinerary
jack
jacket
january
jblu
jetblue
jetway
john
join
joke
journal
juan
july
jump
karen
kick
kind
kiosk
know
kudos
lack
lady
ladygaga
laguardia
lame
land
laptop
large
late
lauderdale
lavatory
layover
lead
leaf
learn
leave
legroom
lesson
letter
level
life
lifetime
light
likely
limit
line
link
list
listen
little
live
livery
lmao
load
local
locate
location
locator
lock
logan
logistics
london
long
longer
look
lose
loss
louis
lounge
lousy
love
lower
loyal
loyalty
luck
lucky
lufthansa
luggage
machine
mail
main
maintenance
major
make
male
malfunction
manage
management
manager
manner
march
mark
market
massive
match
matter
meal
mean
mech
mechanic
mechanical
medical
medium
meet
member
membership
memory
memphis
mention
menu
merge
merger
mess
message
metal
method
mexico
miami
middle
midnight
midway
mile
mileage
mileageplus
military
mind
minor
mint
minute
miserable
misplace
miss
mistake
mobile
model
moment
monday
money
monitor
month
morning
mosaic
mother
movie
multiple
music
musician
nantucket
nashville
nasty
national
nature
necessary
need
negotiate
nervous
neveragain
newark
news
nice
night
nightmare
nonstop
noon
nope
normal
notcool
note
nothappy
notice
notification
notify
number
numerous
offer
office
officer
official
ohare
okay
onboard
online
open
operate
operation
operational
operator
opportunity
option
order
original
orlando
oscar
outlet
outstanding
overall
overhead
overnight
pack
page
pain
painful
pair
palm
paper
paperwork
parent
paris
park
partner
partnership
party
pass
passbook
passenger
passport
past
pathetic
patience
patient
payment
paypal
peanut
penalty
people
perfect
performance
period
perk
person
personal
personnel
philadelphia
phlairport
phoenix
phone
photo
pick
picture
piece
pillow
pilot
piss
pittsburgh
place
plan
plane
plastic
plat
platinum
play
pleasant
plenty
pocket
point
police
policy
poor
poorcustomerservice
poorservice
position
positive
possible
post
pound
power
practice
praise
pray
pref
premier
premium
prepare
present
pretty
prevent
previous
price
print
prior
priority
private
prob
problem
procedure
process
professional
profit
program
promise
promo
promotion
prompt
proper
property
provide
provider
public
puerto
pull
purchase
push
quality
question
queue
quick
quote
race
rain
raise
raleigh
random
rapid
rate
reach
read
ready
reagan
real
realize
reason
reasonable
rebook
rebooked
receipt
receive
recent
recommend
reconsider
record
reference
reflight
refresh
refund
refuse
regard
register
regular
regulation
reimburse
reimbursement
reinstate
relate
relation
relationship
release
remind
reminder
removal
rent
rental
repair
repeat
replacement
reply
report
representative
republican
request
require
reroute
reschedule
reservation
reserve
resolution
resolve
respect
respond
response
responsibility
responsible
rest
result
retrieve
return
revenue
review
reward
rico
ride
ridiculous
right
ripoff
road
rock
room
rough
round
roundtrip
rout
route
rude
ruin
rule
runway
rush
safe
safety
sale
salt
sarcasm
saturday
save
scam
scan
scar
schedule
school
screen
screw
search
seat
seattle
second
section
secure
security
seek
segment
select
selection
self
sell
send
sense
separate
serv
serve
service
shame
shameful
share
ship
shirt
shit
shitty
shock
shoe
shoot
shop
short
shoulder
shout
shut
shuttle
sick
sight
sign
significant
silver
simple
single
sister
site
situation
size
sleep
slow
small
smile
snack
snow
snowy
social
software
solution
solve
somebody
song
sooner
sorry
sort
sound
south
southwest
southwestair
space
spanish
speak
special
specific
speed
spend
spirit
spiritairlines
split
spot
spread
spring
staff
stand
standard
standby
star
staralliance
start
state
statement
status
stay
steal
stellar
step
stewardess
stick
stock
stop
storm
story
straight
strand
stranger
stream
street
stress
stressful
strike
stroller
student
stuff
stun
stupid
submit
success
suck
suggest
suggestion
suit
suitcase
summer
sunday
sunny
super
supervisor
support
suppose
sure
surgery
surprise
survey
sweet
switch
table
tablet
tail
takeoff
talk
tampa
tarmac
taxi
team
tear
tech
technical
teen
telephone
tell
term
terminal
terrible
test
texas
text
thank
thankyou
thats
thing
think
throw
thursday
tick
ticket
till
time
timely
tiny
tire
tmrw
today
toddler
toilet
tomorrow
tonight
total
touch
tough
track
traffic
train
transaction
transfer
transport
transportation
trap
travel
traveler
treat
treatment
trip
trouble
truck
true
trueblue
trust
tues
tuesday
turbulence
turn
tweet
twice
twitter
type
typical
unable
unacceptable
unavailable
unbelievable
uncomfortable
understand
understandable
unfortunate
unfriendlyskies
unhappy
unhelpful
unite
unitedairlines
unitedfail
unitedsucks
unload
unnecessary
unprofessional
unreal
unused
update
upgrade
upset
usair
usairways
usairwaysfail
usairwayssucks
useful
useless
user
usual
vacation
valid
value
vega
velourlive
video
view
virgin
virginamerica
virginatlantic
visa
visit
voice
volume
volunteer
voucher
wait
waive
wake
walk
wall
wanna
want
warm
warn
washington
waste
watch
water
waterbury
weak
weather
website
wednesday
week
weekend
welcome
west
whats
wheel
wheelchair
white
wife
wifi
window
wine
winner
winter
wish
woman
wonder
wonderful
wont
word
work
worker
world
worry
worse
worst
worstairlineever
worstcustomerservice
worth
worthless
wreck
write
wrong
yall
yeah
year
yell
yesterday
york
young
youre
zero
[CLS]
[UNK]
